//据说，鲁智深一天中午匆匆来到开封府大相国寺，想蹭顿饭吃，当时大相国寺有99个和尚，只做了99个馒头，智清长老不愿得罪鲁智深，便把他安排在一个特定位置，之后对所有人说，
//从我开始报数（围成一圈），第5个人可以吃到馒头（并退下），按照这个公平的方法，所有和尚都吃到了馒头，唯独鲁智深没有吃上。请问他在哪个位置？

#include <stdio.h>

int main()
{
	int a[100] = { 0 };
	int bread;
	int count = 0, i = 0;

	for (bread = 99; bread > 0;)
	{
		if (a[i] == 0) 
			count++;
		if (count == 5)
		{
			count = 0;
			a[i] = 1;
			bread--;
		}
		i++;
		i %= 100;
	}

	for (i = 0; i < 100; i++)
	{
		if (a[i] == 0)
		{
			printf("鲁智深的位置在： %d", i);
			break;
		}
	}

	return 0;
}